# Вариант 1

## 🧩 Задание 1. Сортировка массива (Си)
Написать программу, которая:

- считывает `N` (количество элементов);
- считывает `N` целых чисел;
- сортирует массив **методом выбора (selection sort)**;
- выводит отсортированный массив.

### Пример входных данных
```
5
9 1 4 2 7
```

### Пример результата
```
1 2 4 7 9
```

### Заготовка кода
```c
#include <stdio.h>

int main() {
    int n;
    scanf("%d", &n);

    int a[n];
    for (int i = 0; i < n; i++) scanf("%d", &a[i]);

    // TODO: реализовать сортировку выбором

    for (int i = 0; i < n; i++) printf("%d ", a[i]);
    return 0;
}
```

---

## 🧩 Задание 2. Структуры данных: стек
Реализовать стек на массиве фиксированного размера (например, 100 элементов).  
Поддержать операции:

- `push X`
- `pop`
- `print` — вывод всех элементов стека сверху вниз

Вход заканчивается командой `exit`.

### Пример входных данных
```
push 10
push 20
push 30
pop
print
exit
```

### Пример результата
```
20
10
```

---

## 🧩 Задание 3. Динамическая память: структура с гибким массивом
Создать структуру:

```c
struct Vector {
    int size;
    int data[];
};
```

Написать программу, которая:

- считывает `N`;
- выделяет память под структуру `Vector` с массивом на `N` элементов;
- заполняет массив числами;
- выводит сумму всех элементов.

### Пример входных данных
```
4
1 2 3 4
```

### Пример результата
```
10
```

---

# Вариант 2

## 🧩 Задание 1. Сортировка массива пузырьком
Написать программу, которая сортирует массив **bubble sort**.

### Пример входных данных
```
6
5 4 3 2 1 0
```

### Пример результата
```
0 1 2 3 4 5
```

---

## 🧩 Задание 2. FIFO очередь
Реализовать очередь (FIFO) на массиве фиксированного размера.  
Поддержать команды:

- `add X`
- `get` — извлечь элемент
- `print` — вывести очередь слева направо

### Пример входных данных
```
add 5
add 7
add 9
get
print
exit
```

### Пример результата
```
7 9
```

---

## 🧩 Задание 3. Динамическая память: работа с указателями
Написать программу, которая:

- выделяет память под массив `int` размером `N`;
- заполняет его;
- создаёт **второй массив**, где каждый элемент — удвоенное значение исходного;
- выводит второй массив.

### Пример входных данных
```
3
10 20 30
```

### Пример результата
```
20 40 60
```

---

# Вариант 3

## 🧩 Задание 1. Сортировка вставками
Написать программу, которая сортирует массив **insertion sort**.

### Пример входных данных
```
5
8 3 6 1 2
```

### Пример результата
```
1 2 3 6 8
```

---

## 🧩 Задание 2. Односвязный список
Реализовать список с операциями:

- `push_front X`
- `push_back X`
- `pop_front`
- `print`

### Пример входных данных
```
push_back 10
push_front 5
push_back 20
pop_front
print
exit
```

### Пример результата
```
10 20
```

---

## 🧩 Задание 3. Динамическая память: структура с гибким массивом
Создать структуру:

```c
struct Packet {
    int count;
    char data[];
};
```

Программа должна:

- считать число `count`;
- выделить память под структуру и массив `char` длиной `count`;
- считать строку длиной `count`;
- вывести строку в обратном порядке.

### Пример входных данных
```
5
hello
```

### Пример результата
```
olleh
```

---

# 🛠 Инструкция по сборке и запуску (Linux / macOS / Windows + MinGW)

## Сборка
Выполнить в терминале:

```
gcc program.c -o program
```

где `program.c` — имя файла с вашим решением.

## Запуск
```
./program
```

или в Windows:

```
program.exe
```

---

# Вариант 4

## 🧩 Задание 1. Сортировка массива: быстрая сортировка (рекурсивная)
Написать программу, которая:

- считывает `N`;
- считывает `N` целых чисел;
- сортирует массив **быстрой сортировкой (quicksort)**;
- выводит результат.

### Пример входных данных
```
7
9 3 7 1 8 2 5
```

### Пример результата
```
1 2 3 5 7 8 9
```

---

## 🧩 Задание 2. Структуры данных: динамический вектор
Реализовать динамический вектор со следующими операциями:

- `push X` — добавить элемент в конец (при необходимости увеличить capacity);
- `pop` — удалить последний элемент;
- `print` — вывести все элементы.

Начальный capacity = 2.

### Пример входных данных
```
push 10
push 20
push 30
pop
print
exit
```

### Пример результата
```
10 20
```

---

## 🧩 Задание 3. Динамическая память: копирование строки вручную
Написать программу, которая:

- считывает строку длиной `N`;
- выделяет память под массив `char` длиной `N+1`;
- вручную копирует строку посимвольно;
- выводит скопированную строку.

### Пример входных данных
```
hello
```

### Пример результата
```
hello
```

---

# Вариант 5

## 🧩 Задание 1. Сортировка массива: сортировка подсчётом
Написать программу, которая:

- считывает `N`;
- считывает `N` чисел от 0 до 100;
- сортирует массив **counting sort**;
- выводит результат.

### Пример входных данных
```
6
4 2 2 8 3 3
```

### Пример результата
```
2 2 3 3 4 8
```

---

## 🧩 Задание 2. Структуры данных: очередь на связном списке
Реализовать очередь (FIFO) на односвязном списке:

- `enqueue X`
- `dequeue`
- `print`

### Пример входных данных
```
enqueue 5
enqueue 7
enqueue 9
dequeue
print
exit
```

### Пример результата
```
7 9
```

---

## 🧩 Задание 3. Динамическая память: структура с гибким массивом (int)
Создать структуру:

```c
struct IntArray {
    int count;
    int data[];
};
```

Программа должна:

- считать `count`;
- выделить память под структуру и массив `int`;
- заполнить массив;
- вывести максимальный элемент.

### Пример входных данных
```
5
1 9 3 7 2
```

### Пример результата
```
9
```

---

# Вариант 6

## 🧩 Задание 1. Сортировка массива: сортировка слиянием
Написать программу, которая:

- считывает `N`;
- считывает `N` чисел;
- сортирует массив **merge sort**;
- выводит результат.

### Пример входных данных
```
5
10 4 6 2 8
```

### Пример результата
```
2 4 6 8 10
```

---

## 🧩 Задание 2. Структуры данных: двусвязный список
Реализовать двусвязный список с командами:

- `push_front X`
- `push_back X`
- `pop_back`
- `print_forward`
- `print_backward`

### Пример входных данных
```
push_back 1
push_back 2
push_front 0
pop_back
print_forward
print_backward
exit
```

### Пример результата
```
0 1
1 0
```

---

## 🧩 Задание 3. Динамическая память: массив структур
Написать программу, которая:

- считывает `N`;
- выделяет память под массив структур:

```c
struct Point {
    int x;
    int y;
};
```

- заполняет массив;
- выводит расстояние от каждой точки до начала координат (округлять не нужно).

Формула:
\[
d = \sqrt{x^2 + y^2}
\]

### Пример входных данных
```
3
3 4
1 1
0 5
```

### Пример результата
```
5.000000
1.414214
5.000000
```

---

# Инструкция по сборке и запуску

## Сборка
```
gcc program.c -o program
```

## Запуск
Linux/macOS:
```
./program
```

Windows:
```
program.exe
```
